app/views/profiles/_form.html.erb

SELECT "profiles".* FROM "profiles" WHERE ("profiles".user_id = 2) LIMIT 1
SELECT "teams".* FROM "teams"
---
    <%= f.label :favorite %> Team<br />
    <%= collection_select(:profile, :favorite, Team.all, :id, :full_name) %>

SELECT "leagues".* FROM "leagues"
---
    <%= f.label :league %> Team<br />
    <%= collection_select(:profile, :league_id, League.all, :id, :name) %>