app/views/profiles/index.html.erb

      <% end %>
      <%= Team.find_by_id(pick.team_id).name%><br />
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" IS NULL LIMIT 1