app/views/profiles/show.html.erb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = 8 LIMIT 1
---
  <b>Favorite Team:</b>
  <%= Team.find_by_id(@profile.favorite).name %>