app/views/matchups/index.html.erb

SELECT "teams".* FROM "teams" WHERE "teams"."id" IS NULL LIMIT 1
---

        <% if Team.find_by_id(matchup.winner)%>