app/controllers/leagues_controller.rb

  def index
    @leagues = League.all
---
SELECT "leagues".* FROM "leagues"

  def show
    @league = League.find(params[:id])
---
SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = 1 LIMIT 1

  def edit
    @league = League.find(params[:id])
---
SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = 1 LIMIT 1

  def create
    @league = League.new(params[:league])

    respond_to do |format|
      if @league.save
---
INSERT INTO "leagues" ("name", "admin", "repick", "created_at", "updated_at") VALUES ('Mark''s League', 1, 't', '2011-10-20 04:17:21.681989', '2011-10-20 04:17:21.681989')