app/controllers/matchups_controller.rb

SELECT "matchups".* FROM "matchups" WHERE "matchups"."week" IS NULL LIMIT 1
---
  def index
    @week_num = params[:week_num]

    @matchups = Matchup.find_all_by_week(@week_num)

SELECT "matchups".* FROM "matchups" WHERE "matchups"."id" = 0 LIMIT 1
---
  def show
    @matchup = Matchup.find(params[:id])

SELECT "matchups".* FROM "matchups" WHERE "matchups"."id" = 1 LIMIT 1
SELECT "teams".* FROM "teams" WHERE "teams"."id" = 4 LIMIT 1
---
  def edit
    @matchup = Matchup.find(params[:id])
    @winner = params[:winner]
    if @winner
      @selected_winner = Team.find_by_id(@winner)

SELECT "matchups".* FROM "matchups" WHERE "matchups"."id" = 65 LIMIT 1
UPDATE "matchups" SET "winner" = 24, "updated_at" = '2011-10-22 16:20:13.384365' WHERE "matchups"."id" = 65
---
  def update
    @matchup = Matchup.find(params[:id])
    if params[:winner]
      @matchup.winner = params[:winner]
    end

    respond_to do |format|
      if @matchup.update_attributes(params[:matchup])