app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" WHERE ("profiles".user_id = 1) LIMIT 1
---
  def index
    @profiles = Profile.all

SELECT "profiles".* FROM "profiles" WHERE ("profiles".user_id = 1) LIMIT 1
---
  def show
    if params[:id]
      @profile = Profile.find(params[:id])

SELECT "profiles".* FROM "profiles" WHERE ("profiles".user_id = 2) LIMIT 1
---
  def edit
    @profile = Profile.find(params[:id])

INSERT INTO "profiles" ("first", "last", "paid", "num_of_picks", "favorite", "user_id", "league_id", "created_at", "updated_at") VALUES ('Mark', 'Vance', 't', 11, 7, 1, NULL, '2011-10-20 04:18:16.695455', '2011-10-20 04:18:16.695455')
---
  def create
    @profile = Profile.new(params[:profile])
    @profile.user_id = current_user.id
    @profile.num_of_picks = params[:num_of_picks]

    respond_to do |format|
      if @profile.save

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 4 LIMIT 1
UPDATE "profiles" SET "league_id" = 1, "updated_at" = '2011-10-20 04:21:32.950573' WHERE "profiles"."id" = 1
---
  def update
    @profile = Profile.find(params[:id])

    respond_to do |format|
      if @profile.update_attributes(params[:profile])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 2 LIMIT 1
DELETE FROM "profiles" WHERE "profiles"."id" = 2
---
  def destroy
    @profile = Profile.find(params[:id])
    @profile.destroy